mod algorithm;
use std::io;
use std::io::Write;

mod information;


fn main(){

    let mut command : String = String::new();
    println!("");
    println!("██╗  ██╗ █████╗ ███████╗██╗  ██╗ ██████╗██████╗ ██╗   ██╗");
    println!("██║  ██║██╔══██╗██╔════╝██║  ██║██╔════╝██╔══██╗╚██╗ ██╔╝");
    println!("███████║███████║███████╗███████║██║     ██████╔╝ ╚████╔╝ ");
    println!("██╔══██║██╔══██║╚════██║██╔══██║██║     ██╔══██╗  ╚██╔╝   ");
    println!("██╔══██║██╔══██║╚════██║██╔══██║██║     ██╔══██╗  ╚██╔╝  ");
    println!("██║  ██║██║  ██║███████║██║  ██║╚██████╗██║  ██║   ██║   ");
    println!("╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝   ╚═╝");
    println!("");
    loop {
        print!("command@hashcry >>> ");
        io::stdout().flush().expect("Failed to flush stdout");
        io::stdin().read_line(&mut command).expect("Failed to read line");
        let command = command.trim();
        if command == "exit" || command == "quit" {
            println!("Exiting HashCry...");
            break;
        }
        if command == "--available-algorithms" || command == "--avail-algos" {
            information::about::avaiable_algorithms();
        }
        if command == "--manual" {
            information::about::manual();
        }
    }
}